In [3]:
import numpy as np
import pandas as pd

data = pd.DataFrame({'食物':['培根','豬肉','培根','熏牛肉','咸牛肉','培根','熏牛肉','蜂蜜火腿','熏鮭魚'],
                    '重量':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

     食物    重量
0    培根   4.0
1    豬肉   3.0
2    培根  12.0
3   熏牛肉   6.0
4   咸牛肉   7.5
5    培根   8.0
6   熏牛肉   3.0
7  蜂蜜火腿   5.0
8   熏鮭魚   6.0

In [6]:
mean_to_animal = {
   '培根':'豬',
    '豬肉':'豬',
    '熏牛肉':'牛',
    '咸牛肉':'牛',
    '蜂蜜火腿':'豬',
    '熏鮭魚':'魚'
}
data['動物'] = data['食物'].map(mean_to_animal)

In [7]:
data

     食物    重量 動物
0    培根   4.0  豬
1    豬肉   3.0  豬
2    培根  12.0  豬
3   熏牛肉   6.0  牛
4   咸牛肉   7.5  牛
5    培根   8.0  豬
6   熏牛肉   3.0  牛
7  蜂蜜火腿   5.0  豬
8   熏鮭魚   6.0  魚

In [8]:
#改變index或欄位的內容
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['台北','台中','台南'],
                   columns = ['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11

In [9]:
data.index

Index(['台北', '台中', '台南'], dtype='object')

In [10]:
data.index.map(lambda x:x+'(台灣)')

Index(['台北(台灣)', '台中(台灣)', '台南(台灣)'], dtype='object')

In [11]:
data.index = data.index.map(lambda x:x+'(台灣)')
data

        one  two  three  four
台北(台灣)    0    1      2     3
台中(台灣)    4    5      6     7
台南(台灣)    8    9     10    11

In [15]:
data.columns = data.columns.map(lambda x:x.upper())
data

        ONE  TWO  THREE  FOUR
台北(台灣)    0    1      2     3
台中(台灣)    4    5      6     7
台南(台灣)    8    9     10    11